[{"character":"JANE","text":"I need a father who's a role model, not some horny geek-boy who's gonna spray his shorts whenever I bring a girlfriend home from school.What a lame-o. Somebody really should put him out of his misery."},{"character":"RICKY","text":"Want me to kill him for you?"},{"character":"JANE","text":"Yeah, would you?"},{"character":"LESTER","text":"My name is Lester Burnham. This is my neighborhood. This is my street. This... is my life. I'm forty-two years old. In less than a year, I'll be dead.Of course, I don't know that yet.And in a way, I'm dead already.Look at me, jerking off in the shower.This will be the high point of my day. It's all downhill from here.That's my wife Carolyn. See the way the handle on those pruning shears matches her gardening clogs? That's not an accident.Hush, Bitsy. You hush. What is wrong?That's our next-door neighbor Jim.And that's his lover, Jim.What in the world is wrong with her? She had a walk this morning.And a jerky treat.You spoil her.Bitsy. No bark. Come inside. Now."},{"character":"CAROLYN","text":"Good morning, Jim!Morning, Carolyn.I just love your tie! That color!I just love your roses. How do you get them to flourish like this?Well, I'll tell you. Egg shells and Miracle Grow."},{"character":"LESTER","text":"Man. I get exhausted just watching her.She wasn't always like this. She used to be happy. We used to be happy.My daughter Jane. Only child.Janie's a pretty typical teenager. Angry, insecure, confused. I wish I could tell her that's all going to pass...But I don't want to lie to her."},{"character":"CAROLYN","text":"Jane. Honey. Are you trying to look unattractive?"},{"character":"JANE","text":"Yes."},{"character":"CAROLYN","text":"Well, congratulations. You've succeeded admirably.Lester, could you make me a little later, please? Because I'm not quite late enough."},{"character":"JANE","text":"Nice going, Dad."},{"character":"LESTER","text":"Both my wife and daughter think I'm this gigantic loser, and... they're right.I have lost something. I'm not exactly sure what it is, but I know I didn't always feel this... sedated. But you know what? It's never too late to get it back.Hello, this is Lester Burnham from Media Monthly magazine, I'm calling for Mr. Tamblin, please?... Well, we're all under a deadline here, uh, but you see, there is some basic information about the product launch that isn't even covered in your press release and I... Yeah. Can I ask you a question? Who is Tamblin? Does he exist? 'Cause he doesn't ever seem to come in... Yeah, okay, I'll leave my number...It's 555 0199. Lester Burnham. Thank you!"},{"character":"BRAD","text":"Hey Les. You got a minute?"},{"character":"LESTER","text":"For you, Brad? I've got five."},{"character":"BRAD","text":"I'm sure you can understand our need to cut corners around here."},{"character":"LESTER","text":"Oh, sure. Times are tight, and you gotta free up cash. Gotta spend money to make money. Right?"},{"character":"BRAD","text":"Exactly. So..."},{"character":"LESTER","text":"Like the time when Mr. Flournoy used the company MasterCard to pay for that hooker, and then she used the card numbers and stayed at the St. Regis for, what was it, like, three months?"},{"character":"BRAD","text":"That's unsubstantiated gossip."},{"character":"LESTER","text":"That's fifty thousand dollars. That's somebody's salary. That's somebody who's gonna get fired because Craig has to pay women to fuck him!"},{"character":"BRAD","text":"Jesus. Calm down. Nobody's getting fired yet. That's why we're having everyone write out a job description, mapping out in detail how they contribute. That way, management can assess who's valuable and--"},{"character":"LESTER","text":"Who's expendable."},{"character":"BRAD","text":"It's just business."},{"character":"LESTER","text":"I've been writing for this magazine for fourteen years, Brad. You've been here how long, a whole month?"},{"character":"BRAD","text":"I'm one of the good guys, Les. I'm trying to level with you. This is your one chance to save your job."},{"character":"CAROLYN","text":"--there is no decision, you just write the damn thing!"},{"character":"LESTER","text":"You don't think it's weird and kinda fascist?"},{"character":"CAROLYN","text":"Possibly. But you don't want to be unemployed."},{"character":"LESTER","text":"Oh, well, let's just all sell our souls and work for Satan, because it's more convenient that way."},{"character":"CAROLYN","text":"Could you be just a little bit moredramatic, please, huh?So we've finally got new neighbors. You know, if the Lomans had let merepresent them, instead of----\"The Real Estate King,\" that house would never have sat on the market for six months."},{"character":"LESTER","text":"Well, they were still mad at you for cutting down their sycamore."},{"character":"CAROLYN","text":"Their sycamore? C'mon! A substantial portion of the root structure was on our property. You know that. How can you call it their sycamore? I wouldn't have the heart to just cut down something if it wasn't partially mine, which of course it was."},{"character":"JANE","text":"Mom, do we always have to listen to this elevator music?"},{"character":"CAROLYN","text":"No. No, we don't. As soon as you'veprepared a nutritious yet savory meal that I'm about to eat, you can listen to whatever you like."},{"character":"LESTER","text":"So Janie, how was school?"},{"character":"JANE","text":"It was okay."},{"character":"LESTER","text":"Just okay?"},{"character":"JANE","text":"No, Dad. It was spec-tac-ular."},{"character":"LESTER","text":"Well, you want to know how things went at my job today?They've hired this efficiency expert, this really friendly guy named Brad, how perfect is that? And he's basically there to make it seem like they're justified in firing somebody, because they couldn't just come right out and say that, could they? No, no, that would be too... honest. And so they've asked us----you couldn't possibly care any less, could you?"},{"character":"JANE","text":"Well, what do you expect? You can't all of a sudden be my best friend, just because you had a bad day.I mean, hello. You've barely even spoken to me for months."},{"character":"LESTER","text":"Oh, what, you're mother-of-the-year? You treat her like an employee."},{"character":"CAROLYN","text":"What?!What?"},{"character":"LESTER","text":"I'm going to get some ice cream.Honey, I'm sorry. I...I'm sorry I haven't been more available, I just... I'm...You know, you don't always have to wait for me to come to you..."},{"character":"JANE","text":"Oh, great. So now it's my fault?"},{"character":"LESTER","text":"I didn't say that. It's nobody's fault. Janie, what happened? You and I used to be pals.Carolyn BurnhamAnother One SOLDBy Buddy Kane The Real Estate King"},{"character":"CAROLYN","text":"I will sell this house today.I will sell this house today. I will sell this house today. I will sell this house today.I will sell this house today.Welcome. I'm Carolyn Burnham!This living room is very dramatic. Wait 'til you see the native stone fireplace!A simple cream would really lighten things up. You could even put in a skylight.Well, why don't we go into the kitchen?It's a dream come true for any cook. Just filled with positive energy. Huh?...and you'll be surprised how much a ceiling fan can cut down on your energy costs.You know, you could have some really fun backyard get-togethers out here.The ad said this pool was \"lagoon- like.\" There's nothing \"lagoon-like\" about it. Except for maybe the bugs.There's not even any plants out here.What do you call this? Is this not a plant? If you have a problem with the plants, I can always call my landscape architect. Solved.I mean, I think \"lagoon,\" I think waterfall, I think tropical. This is a cement hole.I have some tiki torches in the garage.Shut up. Stop it. You... Weak!Weak. Baby. Shut up. Shut up! Shut up!"},{"character":"ANGELA","text":"Who are you looking for?"},{"character":"JANE","text":"My parents are coming tonight. They're trying to, you know, take an active interest in me."},{"character":"ANGELA","text":"Gross. I hate it when my mom does that."},{"character":"JANE","text":"They're such assholes. Why can't they just have their own lives?"},{"character":"LESTER","text":"What makes you so sure she wants us to be there? Did she ask us to come?"},{"character":"CAROLYN","text":"Of course not. She doesn't want us to know how important this is to her. But she's been practicing her steps for weeks."},{"character":"LESTER","text":"Well, I bet money she's going to resent it. And I'm missing the James Bond marathon on TNT."},{"character":"CAROLYN","text":"Lester, this is important. I'm sensing a real distance growing between you and Jane."},{"character":"LESTER","text":"Growing? She hates me."},{"character":"CAROLYN","text":"She's just willful."},{"character":"LESTER","text":"She hates you too."},{"character":"ANNOUNCER","text":"And now, for your half-time entertainment, Rockwell High's award- winning Dancing Spartanettes!"},{"character":"LESTER","text":"We can leave right after this, right?"},{"character":"JANE","text":"Oh shit, they're still here."},{"character":"LESTER","text":"Janie!"},{"character":"CAROLYN","text":"Hi! I really enjoyed that!"},{"character":"LESTER","text":"Congratulations, honey, you were great."},{"character":"JANE","text":"I didn't win anything."},{"character":"LESTER","text":"Hi, I'm Lester. Janie's dad."},{"character":"ANGELA","text":"Oh. Hi."},{"character":"JANE","text":"This is my friend, Angela Hayes."},{"character":"LESTER","text":"Okay, good to meet you. You were also good tonight. Very... precise."},{"character":"ANGELA","text":"Thanks."},{"character":"CAROLYN","text":"Nice to meet you, Angela.Honey, I'm so proud of you. I watched you very closely, and you didn't screw up once.Okay, we have to go."},{"character":"LESTER","text":"So, what are you girls doing now?"},{"character":"JANE","text":"Dad."},{"character":"ANGELA","text":"We're going out for pizza."},{"character":"LESTER","text":"Oh really, do you need a ride? We can give you a ride. I have a car. You wanna come with us?"},{"character":"ANGELA","text":"Thanks... but I have a car."},{"character":"LESTER","text":"Oh, you have a car. Oh. That's great! That's great, because Janie's thinking about getting a car soon too, aren't you, honey?"},{"character":"JANE","text":"Dad. Mom's waiting for you."},{"character":"LESTER","text":"Well, it was very nice meeting you, Angela. Any, uh, friend of Janie's is a friend of mine.Well... I'll be seeing you around then."},{"character":"JANE","text":"Could he be any more pathetic?"},{"character":"ANGELA","text":"I think it's sweet. And I think he and your mother have not had sex in a long time."},{"character":"LESTER","text":"It's the weirdest thing.I feel like I've been in a coma for about twenty years, and I'm just now waking up.Spec-tac-ular."},{"character":"JANE","text":"I'm sorry my dad was so weird tonight."},{"character":"ANGELA","text":"It's okay. I'm used to guys drooling over me. It started when I was about twelve, I'd go out to dinner with my parents. Every Thursday night, Red Lobster. And every guy there would stare at me when I walked in. And I knew what they were thinking. Just like I knew guys at school thought about me when they jerked off."},{"character":"JANE","text":"Vomit."},{"character":"ANGELA","text":"No, I liked it. And I still like it. If people I don't even know look at me and want to fuck me, it means I really have a shot at being a model. Which is great, because there's nothing worse in life than being ordinary."},{"character":"JANE","text":"I really think it'll happen for you."},{"character":"ANGELA","text":"Oh, I know. Because everything that was meant to happen, does. Eventually."},{"character":"JANE","text":"Asshole."},{"character":"ANGELA","text":"Hello? Hello?"},{"character":"JANE","text":"Hello?"},{"character":"ANGELA","text":"Why'd you call me?"},{"character":"JANE","text":"I didn't."},{"character":"ANGELA","text":"Well, my phone just rang and I answered it and somebody hung up and then I star sixty-nined and it called you back."},{"character":"JANE","text":"I was in the shower.Oh, gross.Rick-y! Break-fast!"},{"character":"RICKY","text":"Be right there.The Wall Street Mom."},{"character":"BARBARA","text":"Hello."},{"character":"RICKY","text":"I don't eat bacon, remember?"},{"character":"BARBARA","text":"I'm sorry, I must have forgotten."},{"character":"RICKY","text":"What's new in the world, Dad?"},{"character":"COLONEL","text":"This country is going straight to hell.Are you expecting anyone?"},{"character":"BARBARA","text":"No.No.Hi.Welcome to the neighborhood.Just a little something from our garden.Except for the pasta, we got that at Fallaci's.It's unbelievably fresh. You just drop it in the water and it's done.JIM #1 (cont’d)Jim Olmeyer. Two doors down. Welcome to the neighborhood."},{"character":"COLONEL","text":"Colonel Frank Fitts, U.S. Marine Corps.Nice to meet you. And this is my partner...Jim Berkley, but people call me Let's cut to the chase, okay? What are you guys selling?Nothing. We just wanted to say hi to our new neighbors--Yeah, yeah, yeah. But you said you're partners. So what's your business?Well, he's a tax attorney.And he's an anesthesiologist.How come these faggots always have to rub it in your face? How can they be so shameless?"},{"character":"RICKY","text":"That's the whole thing, Dad. They don't feel like it's anything to be ashamed of."},{"character":"COLONEL","text":"Well, it is."},{"character":"RICKY","text":"Yeah, you're right."},{"character":"COLONEL","text":"Don't placate me like I'm your mother, boy."},{"character":"RICKY","text":"Forgive me, sir, for speaking so bluntly, but those fags make me want to puke my fucking guts out."},{"character":"COLONEL","text":"Me too, son. Me too."},{"character":"ANGELA","text":"I'm serious, he just pulled down his pants and yanked it out. You know, like, say hello to Mr. Happy.Gross.It wasn't gross. It was kind of cool.So, did you do it with him?Of course I did. He is a really well- known photographer? He shoots for Elle on like, a regular basis? It would have been so majorly stupid of me to turn him down.You are a total prostitute.Hey. That's how things really are. You just don't know, because you're this pampered little suburban chick.So are you. You've only been in Seventeen once, and you looked fat, so stop acting like you're goddamn Christy Turlington.Cunt!I am so sick of people taking their insecurities out on me."},{"character":"JANE","text":"Oh my God. That's the pervert who filmed me last night."},{"character":"ANGELA","text":"Him? Jane. No way. He's a total lunatic."},{"character":"JANE","text":"You know him?"},{"character":"ANGELA","text":"Yeah. We were on the same lunch shift when I was in ninth grade, and he would always say the most random, weird things, and then one day, he was just like, gone. And then, Connie Cardullo told me he his parents had to put him in a mental institution."},{"character":"JANE","text":"Why? What did he do?"},{"character":"ANGELA","text":"What do you mean?"},{"character":"JANE","text":"Well, they can't put you away just for saying weird things."},{"character":"ANGELA","text":"You total slut. You've got a crush on him."},{"character":"JANE","text":"What? Please."},{"character":"ANGELA","text":"You were defending him! You love him. You want to have like, ten thousand of his babies."},{"character":"JANE","text":"Shut up."},{"character":"RICKY","text":"Hi. My name's Ricky. I just moved next door to you."},{"character":"JANE","text":"I know. I kinda remember this really creepy incident when you were filming me last night?"},{"character":"RICKY","text":"I didn't mean to scare you. I just think you're interesting."},{"character":"JANE","text":"Thanks, but I really don't need to have some psycho obsessing about me right now."},{"character":"RICKY","text":"I'm not obsessing. I'm just curious."},{"character":"ANGELA","text":"What a freak. And why does he dress like a Bible salesman?"},{"character":"JANE","text":"He's like, so confident. That can't be real."},{"character":"ANGELA","text":"I don't believe him. I mean, he didn't even like, look at me once."},{"character":"RICKY","text":"Hey."},{"character":"BARBARA","text":"I'm sorry, what?"},{"character":"RICKY","text":"Mom. Nobody said anything."},{"character":"BARBARA","text":"Oh. I'm sorry."},{"character":"CAROLYN","text":"--everyone here is with their spouse or their significant other. How would it look if I showed up with no one?"},{"character":"LESTER","text":"Well, you always end up ignoring me and going off--"},{"character":"CAROLYN","text":"Now listen to me. This is an important business function. As you know, my business is selling an image. And part of my job is to live that image--"},{"character":"LESTER","text":"Just say whatever you want to say and spare me the propaganda."},{"character":"CAROLYN","text":"Hi, Shirley!Listen, just do me a favor. Act happy tonight?"},{"character":"LESTER","text":"I am happy, honey."},{"character":"CAROLYN","text":"Oh! Buddy!Buddy! Buddy. Hi! Good to see you again."},{"character":"BUDDY","text":"It's so good to see you too, Catherine."},{"character":"CAROLYN","text":"Carolyn."},{"character":"BUDDY","text":"Carolyn! Of course. How are you?"},{"character":"CAROLYN","text":"Very well, thank you.Hello, Christy."},{"character":"CHRISTY","text":"Hello."},{"character":"CAROLYN","text":"My husband, Lester--"},{"character":"BUDDY","text":"It's a pleasure."},{"character":"LESTER","text":"Oh, we've met before, actually. This thing last year. Or the Christmas thing at the Sheraton."},{"character":"BUDDY","text":"Oh, yes."},{"character":"LESTER","text":"It's okay. I wouldn't remember me either."},{"character":"CAROLYN","text":"Honey. Don't be weird."},{"character":"LESTER","text":"All right, honey. I won't be weird.I'll be whatever you want me to be.We have a very healthy relationship."},{"character":"BUDDY","text":"I see."},{"character":"LESTER","text":"Well. I don't know about you, but I need a drink.Whoa. Put a little more in there, cowboy."},{"character":"RICKY","text":"Excuse me. Don't you live on Robin Hood Trail? The house with the red door?"},{"character":"LESTER","text":"Yeah."},{"character":"RICKY","text":"I'm Ricky Fitts. I just moved into the house next to you."},{"character":"LESTER","text":"Oh. Hi, Ricky Fitts. I'm Lester Burnham."},{"character":"RICKY","text":"Hi, Lester Burnham.Do you party?"},{"character":"LESTER","text":"Excuse me?"},{"character":"RICKY","text":"Do you get high?"},{"character":"CAROLYN","text":"You know, I probably wouldn't even tell you this if I weren't a little tipsy, but... I am in complete awe of you. I mean, your firm is, hands down, the Rolls Royce of local Real Estate firms, and your personal sales record is, is, is very intimidating. You know, I'd love to sit down with you and just pick your brain, if you'd ever be willing. I suppose, technically, I'm the \"competition,\" but... I mean, hey, I don't flatter myself that I'm even in the same league as you..."},{"character":"BUDDY","text":"I'd love to."},{"character":"CAROLYN","text":"Really?"},{"character":"BUDDY","text":"Absolutely. Call my secretary and have her schedule a lunch."},{"character":"CAROLYN","text":"I'll do that. Thank you."},{"character":"LESTER","text":"...Did you ever see that movie, where the body's walking around holding its own head? And then the head goes down on that babe?"},{"character":"RICKY","text":"Re-Animator.Look. I'm not paying you to...(eyes Lester, suspiciously)...do whatever it is you're doing out here.Fine. So don't pay me.Excuse me?I quit. So you don't have to pay me. Now, leave me alone.Asshole."},{"character":"LESTER","text":"I think you just became my personal hero.Doesn't that make you nervous, just quitting your job like that? Well, I guess when you're all of, what? Sixteen?"},{"character":"RICKY","text":"Eighteen.I just do these gigs as a cover. I have other sources of income. But my dad interferes less in my life when I pretend to be an upstanding young citizen with a respectable job."},{"character":"CAROLYN","text":"Lester?What are you doing?"},{"character":"LESTER","text":"Honey, this is...Ricky Fitts. This is Ricky Fitts."},{"character":"RICKY","text":"I'm Ricky Fitts, I just moved in the house next to you. I go to school with your daughter."},{"character":"LESTER","text":"With Jane? Really?"},{"character":"RICKY","text":"Yeah. Jane."},{"character":"CAROLYN","text":"Hi.I'm ready to go. I'll meet you out front."},{"character":"LESTER","text":"Uh-oh. I'm in trouble. Nice meeting you, Ricky Fitts. Thanks for the, uh, thing."},{"character":"RICKY","text":"Any time.Lester. If you want any more, you know where I live."},{"character":"JANE","text":"Oh, shit. They're home. Quick, let's go up to my room."},{"character":"ANGELA","text":"I should say hi to your dad.I don't want to be rude.Nice suit.You're looking good, Mr. Burnham.Last time I saw you, you looked kind of wound up.Ooh, is that root beer?I love root beer, don't you?"},{"character":"JANE","text":"Mom, you remember Angela."},{"character":"CAROLYN","text":"Yes, of course!"},{"character":"JANE","text":"I forgot to tell you, she's spending the night. Is that okay?"},{"character":"LESTER","text":"Sure!"},{"character":"JANE","text":"I'm sorry about my dad."},{"character":"ANGELA","text":"Don't be. I think it's funny."},{"character":"JANE","text":"Yeah, to you, he's just another guy who wants to jump your bones. But to me... he's just too embarrassing to live."},{"character":"ANGELA","text":"Your mom's the one who's embarrassing. What a phony.Shut up.He is. If he just worked out a little, he'd be hot."},{"character":"JANE","text":"Shut up."},{"character":"ANGELA","text":"Oh, come on. Like you've never sneaked a peek at him in his underwear? I bet he's got a big dick."},{"character":"JANE","text":"You are so grossing me out right now."},{"character":"ANGELA","text":"If he built up his chest and arms, I would totally fuck him.I would! I would suck your dad's big fat dick, and then I would fuck him 'til his eyes rolled back in his head!What was that noise? Jane.I swear I heard something."},{"character":"JANE","text":"Yeah, it was the sound of you being a huge disgusting pig."},{"character":"ANGELA","text":"I'm serious.See?Oh my God. Jane.It's that psycho next door. Jane, what if he worships you? What if he's got a shrine with pictures of you surrounded by dead people's heads and stuff?"},{"character":"JANE","text":"Shit. I bet he's filming us right now."},{"character":"ANGELA","text":"Really?"},{"character":"LESTER","text":"Shit. Shit!"},{"character":"RICKY","text":"Welcome to America's Weirdest Home Videos."},{"character":"COLONEL","text":"Ricky!"},{"character":"RICKY","text":"Coming, Dad."},{"character":"COLONEL","text":"You know I don't like locked doors in my house, boy."},{"character":"RICKY","text":"I'm sorry, I must have locked it by accident. So what's up?"},{"character":"COLONEL","text":"I need a urine sample."},{"character":"RICKY","text":"Wow. It's been six months already. Can I give it to you in the morning? I just took a whiz."},{"character":"COLONEL","text":"Yeah, I suppose.Well. Good night, son."},{"character":"ANGELA","text":"I've been waiting for you.You've been working out, haven't you? I can tell.I was hoping you'd give me a bath... I'm very, very dirty."},{"character":"CAROLYN","text":"What are you doing?"},{"character":"LESTER","text":"Nothing."},{"character":"CAROLYN","text":"You were masturbating."},{"character":"LESTER","text":"I was not."},{"character":"CAROLYN","text":"Yes, you were."},{"character":"LESTER","text":"All right, so shoot me. I was whacking off.That's right. I was choking the bishop. Shaving the carrot. Saying hi to my monster."},{"character":"CAROLYN","text":"That's disgusting."},{"character":"LESTER","text":"Well, excuse me, but I still have blood pumping through my veins!"},{"character":"CAROLYN","text":"So do I!"},{"character":"LESTER","text":"Really? I'm the only one who seems to be doing anything about it."},{"character":"CAROLYN","text":"Lester. I refuse to live like this. This is not a marriage."},{"character":"LESTER","text":"This hasn't been a marriage for years. But you were happy as long as I kept my mouth shut. Well, guess what? I've changed. And the new me whacks off when he feels horny, because you're obviously not going to help me out in that department."},{"character":"CAROLYN","text":"Oh. I see. You think you're the only one who's sexually frustrated?"},{"character":"LESTER","text":"I'm not? Well then, come on, baby! I'm ready."},{"character":"CAROLYN","text":"Do not mess with me, mister, or I will divorce you so fast it'll make your head spin!"},{"character":"LESTER","text":"On what grounds? I'm not a drunk, I don't fuck other women, I don't mistreat you, I've never hit you, or even tried to touch you since you made it so abundantly clear just how unnecessary you consider me to be. But I did support you while you got your license. And some people might think that entitles me to half of what's yours.Turn out the light when you come to bed, okay?It's a great thing when you realize you still have the ability to surprise yourself. Makes you wonder what else you can do that you've forgotten about.Hey! You guys!Lester, I didn't know you ran.Well, I just started.Good for you.I figured you guys might be able to give me some pointers. I need to shape up. Fast.Well, are you just looking to lose weight, or do you want have increased strength and flexibility as well?I want to look good naked."},{"character":"COLONEL","text":"What is this, the fucking gay pride parade?"},{"character":"LESTER","text":"Hey! Yo! Ricky!My entire life is passing before my eyes, and those two have barely broken a sweat.Sorry, hi. Lester Burnham, I live next door. We haven't met."},{"character":"COLONEL","text":"Colonel Frank Fitts, U.S. Marine Corps."},{"character":"LESTER","text":"Whoa. Welcome to the neighborhood, sir.So, Ricky, uh, I was thinking about the, uh... I was gonna... the moviewe talked about..."},{"character":"RICKY","text":"Re-Animator."},{"character":"LESTER","text":"Yeah!"},{"character":"RICKY","text":"You want to borrow it?Okay, it's up in my room. Come on.Can you hold this for a sec?"},{"character":"LESTER","text":"Sure."},{"character":"RICKY","text":"I don't think my dad would try to come in when somebody else is here, but you never know."},{"character":"LESTER","text":"What is this?"},{"character":"RICKY","text":"Urine. I have to take a drug test every six months to make sure I'm clean."},{"character":"LESTER","text":"Are you kidding? You just smoked with me last night."},{"character":"RICKY","text":"It's not mine. One of my clients is a nurse in a pediatrician's office. I cut her a deal, she keeps me in clean piss."},{"character":"LESTER","text":"You like Pink Floyd?"},{"character":"RICKY","text":"I like a lot of music."},{"character":"LESTER","text":"Man, I haven't listened to this album in years."},{"character":"RICKY","text":"How much do you want?"},{"character":"LESTER","text":"I don't know, it's been a while. How much is an ounce?"},{"character":"RICKY","text":"Well, this is totally decent, and it's three hundred."},{"character":"LESTER","text":"Wow."},{"character":"RICKY","text":"But this shit is top of the line. It's called G-13. Genetically engineered by the U.S. Government. Extremely potent. But a completely mellow high, no paranoia."},{"character":"LESTER","text":"Is that what we smoked last night?"},{"character":"RICKY","text":"This is all I ever smoke."},{"character":"LESTER","text":"How much?"},{"character":"RICKY","text":"Two grand."},{"character":"LESTER","text":"Jesus. Things have changed since "},{"character":"RICKY","text":"You don't have to pay now. I know you're good for it."},{"character":"LESTER","text":"Thanks."},{"character":"RICKY","text":"There's a card in there with my beeper number, call me anytime day or night. And I only accept cash."},{"character":"LESTER","text":"Well, now I know how you can afford all this equipment. When I was your age, I flipped burgers all summer just to be able to buy an eight track."},{"character":"RICKY","text":"That sucks."},{"character":"LESTER","text":"No actually, it was great. All I did was party and get laid.I had my whole life ahead of me..."},{"character":"RICKY","text":"My dad thinks I pay for all this with catering jobs.Never underestimate the power of denial."},{"character":"LESTER","text":"Uh-oh, mom's mad."},{"character":"CAROLYN","text":"What the hell do you think you're doing?"},{"character":"LESTER","text":"Bench presses. I'm going to wail on my pecs, and then I'm going to do my back."},{"character":"CAROLYN","text":"I see you're smoking pot now. I'm so glad. I think using illegal psychotropic substances is a very positive example to set for our daughter."},{"character":"LESTER","text":"You're one to talk, you bloodless, money-grubbing freak."},{"character":"CAROLYN","text":"Lester. You have such hostility in you!"},{"character":"LESTER","text":"Do you mind? I'm trying to work out here.Unless you want to spot me."},{"character":"CAROLYN","text":"You will not get away with this. You can be sure of that!"},{"character":"LESTER","text":"That's. What. You. Think."},{"character":"BRAD","text":"\"...my job consists of basically masking my contempt for the assholes in charge, and, at least once a day, retiring to the men's room so I can jerk off, while I fantasize about a life that doesn't so closely resemble hell.\"Well, you obviously have no interest in saving yourself."},{"character":"LESTER","text":"Brad, for fourteen years I've been a whore for the advertising industry. The only way I could save myself now is if I start firebombing."},{"character":"BRAD","text":"Whatever. Management wants you gone by the end of the day."},{"character":"LESTER","text":"Well, just what sort of severance package is \"management\" prepared to offer me? Considering the information I have about our editorial director buying pussy with company money.Which I'm sure would interest the I.R.S., since it technically constitutes fraud. And I'm sure that some of our advertisers and rival publications might like to know about it as well. Not to mention, Craig's wife."},{"character":"BRAD","text":"What do you want?"},{"character":"LESTER","text":"One year's salary, with benefits."},{"character":"BRAD","text":"That's not going to happen."},{"character":"LESTER","text":"Well, what do you say I throw in a little sexual harassment charge to boot?"},{"character":"BRAD","text":"Against who?"},{"character":"LESTER","text":"Against you.Can you prove you didn't offer to save my job if I'd let you blow me?"},{"character":"BRAD","text":"Man. You are one twisted fuck."},{"character":"LESTER","text":"Nope. I'm just an ordinary guy with nothing to lose.Yeah!"},{"character":"BUDDY","text":"Carolyn."},{"character":"CAROLYN","text":"Buddy."},{"character":"BUDDY","text":"I'm so sorry I kept you waiting. Christy left for New York this morning, and... let's just say things were very hectic around the house."},{"character":"CAROLYN","text":"What's she doing in New York?"},{"character":"BUDDY","text":"She's moving there.Yes. We are splitting up."},{"character":"CAROLYN","text":"Buddy. I'm so sorry."},{"character":"BUDDY","text":"Yes, according to her, I'm too focused on my career. As if being driven to succeed is some sort of character flaw. Well, she certainly knew how to take advantage of the lifestyle my success afforded her. Oh. Wow.Ah, it's for the best."},{"character":"CAROLYN","text":"When I saw you two at the party the other night, you seemed perfectly happy."},{"character":"BUDDY","text":"Well, call me crazy, but it is my philosophy that in order to besuccessful, one must project an image of success, at all times."},{"character":"ANGELA","text":"What are you doing?"},{"character":"RICKY","text":"I was filming this dead bird."},{"character":"ANGELA","text":"Why?"},{"character":"RICKY","text":"Because it's beautiful."},{"character":"ANGELA","text":"I think maybe you forgot your medication today, mental boy."},{"character":"RICKY","text":"Hi, Jane."},{"character":"JANE","text":"Look. I want you to stop filming me."},{"character":"RICKY","text":"Okay."},{"character":"ANGELA","text":"Well, whatever.This is boring. Let's go."},{"character":"JANE","text":"Do you need a ride?"},{"character":"ANGELA","text":"Are you crazy? I don't want to end up hacked to pieces in a dumpster somewhere."},{"character":"RICKY","text":"It's okay. I'll walk. But thanks."},{"character":"ANGELA","text":"Yeah, see? He doesn't want to go anyway. C'mon, let's go."},{"character":"JANE","text":"I think I'm going to walk, too."},{"character":"ANGELA","text":"What? Jane, that's like, almost a mile."},{"character":"CAROLYN","text":"Yes! Oh, God! I love it!"},{"character":"BUDDY","text":"You like getting nailed by the king?"},{"character":"CAROLYN","text":"Oh yes! I love it! Fuck me, your majesty!"},{"character":"LESTER","text":"Smile you're at Mr. Smiley's.What?Would you like to try our new bacon and egg fajita just a dollar twenty- nine for a limited time only.Uh... no. But thank you.I'll have a Big Barn Burger, Smiley fries, and an orange soda.Please drive up to the window, thank you.DRIVE-THRU GIRL (cont’d)Smile, you're at Mr. Smiley's, that'll be four eighty-nine, please.Would you like some Smiley Sauce?No. No, actually... I'd like to fill out an application.There's not jobs for manager, it's just for counter.Good. I'm looking for the least possible amount of responsibility."},{"character":"MANAGER","text":"I don't think you'd fit in here."},{"character":"LESTER","text":"I have fast food experience."},{"character":"MANAGER","text":"Yeah, like twenty years ago."},{"character":"LESTER","text":"Well, I'm sure there have been amazing technological advances in the industry, but surely you have some sort of training process. It seems unfair to presume I won't be able to learn."},{"character":"CAROLYN","text":"That was exactly what I needed. The royal treatment, so to speak.I was so stressed out."},{"character":"BUDDY","text":"Know what I do when I feel like that?"},{"character":"CAROLYN","text":"What?"},{"character":"BUDDY","text":"I fire a gun."},{"character":"CAROLYN","text":"Really."},{"character":"BUDDY","text":"Oh yeah, I go to this little firing range downtown, and I just pop off a few rounds."},{"character":"CAROLYN","text":"I've never fired a gun before."},{"character":"BUDDY","text":"Oh, you've gotta try it. Nothing makes you feel more powerful.Well, almost nothing."},{"character":"JANE","text":"So how do you like your new house?"},{"character":"RICKY","text":"I like it."},{"character":"JANE","text":"The people who used to live there fed these stray cats, so they were always around, and it drove my mother nuts. And then she cut down their tree."},{"character":"RICKY","text":"Have you ever known anybody who died?"},{"character":"JANE","text":"No.Have you?"},{"character":"RICKY","text":"No, but I did see this homeless woman who froze to death once. Just laying there on the sidewalk. She looked really sad.I got that homeless woman on video."},{"character":"JANE","text":"Why would you film that?"},{"character":"RICKY","text":"Because it was amazing."},{"character":"JANE","text":"What was amazing about it?"},{"character":"RICKY","text":"When you see something like that, it's like God is looking right at you, just for a second. And if you're careful, you can look right back."},{"character":"JANE","text":"And what do you see?"},{"character":"RICKY","text":"Beauty.Mom, I want you to meet somebody.Mom."},{"character":"BARBARA","text":"Yes?"},{"character":"RICKY","text":"I want you to meet somebody. This is Jane."},{"character":"JANE","text":"Hi."},{"character":"BARBARA","text":"Oh, my. I apologize for the way things look around here."},{"character":"RICKY","text":"This is where my dad hides out."},{"character":"JANE","text":"I take it he's got a thing for guns."},{"character":"RICKY","text":"You got to see this one thing...My dad would kill me if he knew I was in here."},{"character":"JANE","text":"Did you steal his keys?"},{"character":"RICKY","text":"No. One of my clients is a locksmith. He was short on cash one night, so I let him pay me in trade.Turn it over."},{"character":"JANE","text":"Oh my God."},{"character":"RICKY","text":"It's like official state china of the Third Reich. There's a whole subculture of people who collect this Nazi shit. But my dad just has this one thing.What's wrong?"},{"character":"JANE","text":"Nothing."},{"character":"RICKY","text":"No, you're scared of me."},{"character":"JANE","text":"No I'm not."},{"character":"RICKY","text":"You want to see the most beautiful thing I've ever filmed?It was one of those days when it's a minute away from snowing. And there's this electricity in the air, you can almost hear it, right? And this bag was just... dancingwith me. Like a little kid begging me to play with it. For fifteen minutes. That's the day I realized that there was this entire life behind things, and this incredibly benevolent force that wanted me to know there was no reason to be afraid. Ever.Video's a poor excuse, I know. But it helps me remember... I need to remember...Sometimes there's so much beauty in the world I feel like I can't take it... and my heart is going to cave in."},{"character":"JANE","text":"Oh my God. What time is it?Sorry I'm late."},{"character":"CAROLYN","text":"No, no, that's quite all right, dear. Your father and I were just discussing his day at work.Why don't you tell our daughter about it, honey?"},{"character":"LESTER","text":"Janie, today I quit my job. And then I told my boss to fuck himself, and then I blackmailed him for almost sixty thousand dollars. Pass the asparagus."},{"character":"CAROLYN","text":"Your father seems to think this kind of behavior is something to be proud of."},{"character":"LESTER","text":"And your mother seems to prefer I go through life like a fucking prisoner while she keeps my dick in a mason jar under the sink."},{"character":"CAROLYN","text":"How dare you speak to me that way in front of her? And I marvel that you can be so contemptuous of me, on the same day that you lose your job!"},{"character":"LESTER","text":"Lose it? I didn't lose it. It's not like, \"Oops, where'd my job go?\" I quit. Someone pass me the asparagus."},{"character":"CAROLYN","text":"Oh! Oh! And I want to thank you for putting me under the added pressure of being the sole breadwinner now--"},{"character":"LESTER","text":"I already have a job."},{"character":"CAROLYN","text":"No, no, don't give a second thought as to who's going to pay the mortgage. We'll just leave it all up to Carolyn. You mean, you're going to take care of everything now, Carolyn? Yes. I don't mind. I really don't. You mean, everything? You don't mind having the sole responsibility, your husband feels he can just quit his job--"},{"character":"LESTER","text":"Will someone pass me the fucking asparagus?"},{"character":"JANE","text":"Okay, I'm not going to be a part of this--"},{"character":"LESTER","text":"Sit down.I'm sick and tired of being treated like I don't exist. You two do whatever you want to do whenever you want to do it and I don't complain. All I want is the same courtesy--"},{"character":"CAROLYN","text":"Oh, you don't complain? Oh, excuse me. Excuse me. I must be psychotic then, if you don't complain. What is this?! Am I locked away in a padded cell somewhere, hallucinating? That's the only explanation I can think of--"},{"character":"LESTER","text":"Don't interrupt me, honey.Oh, and another thing. From now on, we're going to alternate our dinner music. Because frankly, and I don't think I'm alone here, I'm really tired of this Lawrence Welk shit."},{"character":"JANE","text":"Go. Away."},{"character":"CAROLYN","text":"Honey, please let me in.I wish that you hadn't witnessed that awful scene tonight. But in a way, I'm glad."},{"character":"JANE","text":"Why, so I could see what freaks you and Dad really are?"},{"character":"CAROLYN","text":"Me?"},{"character":"JANE","text":"Aw, Christ, Mom."},{"character":"CAROLYN","text":"No, I'm glad because you're old enough now to learn the most important lesson in life: you cannot count on anyone except yourself.You cannot count on anyone except yourself. It's sad, but true, and the sooner you learn it, the better."},{"character":"JANE","text":"Look, Mom, I really don't feel like having a Kodak moment here, okay?"},{"character":"CAROLYN","text":"You ungrateful little brat. Just look at everything you have. When I was your age, I lived in a duplex. We didn't even have our own house."},{"character":"COLONEL","text":"You little bastard--How did you get in there?How!? How?! C'mon, get up! Fight back, you little pussy!"},{"character":"RICKY","text":"No, sir. I won't fight you."},{"character":"COLONEL","text":"How did you get in there?"},{"character":"RICKY","text":"I picked the lock, sir."},{"character":"COLONEL","text":"What were you looking for? Money? Are you on dope again?"},{"character":"RICKY","text":"No, sir. I wanted to show my girlfriend your Nazi plate."},{"character":"COLONEL","text":"Girlfriend?"},{"character":"RICKY","text":"Yes, sir. She lives next door.Her name's Jane."},{"character":"COLONEL","text":"This is for your own good, boy. You have no respect for other people's things, for authority, for..."},{"character":"RICKY","text":"Sir, I'm sorry."},{"character":"COLONEL","text":"You can't just go around doing whatever you feel like, you can't-- there are rules in life--"},{"character":"RICKY","text":"Yes, sir."},{"character":"COLONEL","text":"You need structure, you need discipline--"},{"character":"RICKY","text":"Discipline. Yes, sir, thank you for trying to teach me. Don't give up on me, Dad."},{"character":"COLONEL","text":"Oh, Ricky...You stay out of there."},{"character":"ATTENDANT","text":"I gotta say, Mrs. Burnham, when you first came here I thought you would be hopeless. But you're a natural."},{"character":"CAROLYN","text":"Well, all I know is... I love shooting this gun!"},{"character":"LESTER","text":"What?"},{"character":"CAROLYN","text":"Ah, whose car is that out front?"},{"character":"LESTER","text":"Mine. 1970 Pontiac Firebird. The car I always wanted and now I have it. I rule!"},{"character":"CAROLYN","text":"Where's the Camry?"},{"character":"LESTER","text":"I traded it in."},{"character":"CAROLYN","text":"Shouldn't you have consulted me first?"},{"character":"LESTER","text":"Hmm, let me think... No. You never drove it.Have you done something different? You look great."},{"character":"CAROLYN","text":"Where's Jane?"},{"character":"LESTER","text":"Jane not home. We have the whole house to ourselves.Christ, Carolyn. When did you become so... joyless?"},{"character":"CAROLYN","text":"Joyless?! I am not joyless! There happens to be a lot about me that you don't know, mister smarty man. There is plenty of joy in my life."},{"character":"LESTER","text":"Whatever happened to that girl who used to fake seizures at frat parties when she got bored? And who used to run up to the roof of our first apartment building to flash the traffic helicopters? Have you totally forgotten about her? Because I haven't."},{"character":"CAROLYN","text":"Lester. You're going to spill beer on the couch."},{"character":"LESTER","text":"So what? It's just a couch."},{"character":"CAROLYN","text":"This is a four thousand dollar sofa upholstered in Italian silk. This is not \"just a couch.\""},{"character":"LESTER","text":"It's just a couch!This isn't life. This is just stuff. And it's become more important to you than living. Well, honey, that's just nuts.I'm only trying to help you."},{"character":"JANE","text":"Don't."},{"character":"RICKY","text":"Why?"},{"character":"JANE","text":"It's weird, watching myself. I don't like how I look."},{"character":"RICKY","text":"I can't believe you don't know how beautiful you are."},{"character":"JANE","text":"I'm not going to sit here for that shit.Ha. How does it feel now?"},{"character":"RICKY","text":"Fine."},{"character":"JANE","text":"You don't feel naked?"},{"character":"RICKY","text":"I am naked."},{"character":"JANE","text":"You know what I mean.Tell me about being in the hospital."},{"character":"RICKY","text":"When I was fifteen, my dad caught me smoking dope. He totally freaked and decided to send me to military school. I told you his whole thing about structure and discipline, right?Well, of course, I got kicked out. Dad and I had this huge fight, and he hit me... and then the next day at school, some kid made a crack about my haircut, and... I just snapped. I wanted to kill him. And I would have. Killed him. If they hadn't pulled me off.That's when my dad put me in the hospital. Then they drugged me up and left me in there for two years."},{"character":"JANE","text":"Wow. You must really hate him."},{"character":"RICKY","text":"He's not a bad man."},{"character":"JANE","text":"Well... you better believe I'd hate my father if he did something like that to me.Wait. I do hate my father."},{"character":"RICKY","text":"Why?"},{"character":"JANE","text":"He's a total asshole and he's got this crush on my friend Angela and it's disgusting."},{"character":"RICKY","text":"You'd rather he had the crush on you?"},{"character":"JANE","text":"Gross, no! But it'd be nice if I was anywhere near as important to him as she is.I know you think my dad's harmless, but you're wrong. He's doing massive psychological damage to me."},{"character":"RICKY","text":"How?"},{"character":"JANE","text":"Well, now, I too need structure. A little fucking discipline.I'm serious, though. How could he not be damaging me? I need a father who's a role model, not some horny geek-boy who's gonna spray his shorts whenever I bring a girlfriend home from school.What a lame-o. Somebody really should put him out of his misery."},{"character":"RICKY","text":"Want me to kill him for you?"},{"character":"JANE","text":"Yeah, would you?"},{"character":"RICKY","text":"It'll cost you."},{"character":"JANE","text":"Well, I've been baby-sitting since I was about ten. I've got almost three thousand dollars. 'Course, I was saving it up for a boob job.But my tits can wait, huh?"},{"character":"RICKY","text":"You know, that's not a very nice thing to do, hiring somebody to kill your dad."},{"character":"JANE","text":"Well, I guess I'm just not a very nice girl, then, am I?You know I'm not serious, right?"},{"character":"RICKY","text":"Of course.Do you know how lucky we are to have found each other?"},{"character":"LESTER","text":"Remember those posters that said, \"Today is the first day of the rest of your life?\" Well, that's true of every day except one.The day you die."},{"character":"CAROLYN","text":"Jane, hurry up. I've got a very important appointment--"},{"character":"JANE","text":"Mom, is it okay if Angela sleeps over tonight?"},{"character":"CAROLYN","text":"Well, of course, she's always welcome.You know, I thought maybe you two had a fight. I haven't seen her around here in a while."},{"character":"LESTER","text":"What?"},{"character":"JANE","text":"I've been too embarrassed to bring her over. Because of you, and the way that you behave."},{"character":"LESTER","text":"What are you talking about? I've barely even spoken to her."},{"character":"JANE","text":"Dad! You stare at her all the time, like you're drunk! It's disgusting!"},{"character":"LESTER","text":"You better watch yourself, Janie, or you're going to turn into a real bitch, just like your mother.Fuck."},{"character":"COLONEL","text":"You ready to go?"},{"character":"RICKY","text":"Oh, I don't need a ride. I'm going to go in with Jane and her mom."},{"character":"LESTER","text":"Yo, Ricky. How's it going?"},{"character":"RICKY","text":"Pretty decent, Mr. Burnham."},{"character":"CO-WORKER","text":"Hey Lester, I need that Super Smiley with cheese, A.S.A.P."},{"character":"LESTER","text":"You need more than that, my little hombre."},{"character":"CAROLYN","text":"What's good here?"},{"character":"BUDDY","text":"Nothing."},{"character":"CAROLYN","text":"Then I guess we'll just have to be bad, won't we?I think I'll have a double Smiley Sandwich and curly fries, and a vanilla shake."},{"character":"BUDDY","text":"Make that two.Please drive around thank you."},{"character":"CAROLYN","text":"I think we deserve a little junk food, after the workout we had this morning."},{"character":"BUDDY","text":"I'm flattered."},{"character":"LESTER","text":"Smile! You're at Mr. Smiley's!Would you like to try our new beef and cheese pot pie on a stick, just a dollar ninety-nine for a limited time only?"},{"character":"CAROLYN","text":"We were just at a seminar.Buddy, this is my--"},{"character":"LESTER","text":"Her husband. We've met before, but something tells me you're going to remember me this time.Whoa. You are so busted."},{"character":"CAROLYN","text":"You know, this really doesn't concern you."},{"character":"LESTER","text":"Actually, Janeane is senior drive- thru manager, so you kind of are on her turf.So. This makes sense."},{"character":"CAROLYN","text":"Oh, Lester--"},{"character":"LESTER","text":"Honey, it's okay. I want you to be happy.Would you like Smiley Sauce with that?"},{"character":"CAROLYN","text":"Lester, just stop it!"},{"character":"LESTER","text":"Uh-uh. You don't get to tell me what to do. Ever again."},{"character":"BUDDY","text":"I'm sorry. I guess we should cool it for a while. I'm facing a potentially very expensive divorce."},{"character":"CAROLYN","text":"Oh, no. I understand completely.In order to be successful, one must project an image of success. At all times.Stop it. Stop it!"},{"character":"LESTER","text":"Shit."},{"character":"RICKY","text":"I have to run next door. Jane left her geometry book in my bag and she needs it to do her homework."},{"character":"ANGELA","text":"So you and psycho boy are fucking on like, a regular basis now, right?"},{"character":"JANE","text":"No."},{"character":"ANGELA","text":"Oh, come on. You can tell me. Does he have a big dick?"},{"character":"JANE","text":"Look, I'm not gonna talk about his dick with you, okay? It's not like that."},{"character":"ANGELA","text":"Not like what? Doesn't he have one?Why don't you want to talk about it? I mean, I tell you every single detail about every guy that I fuck."},{"character":"JANE","text":"Yeah, and maybe you shouldn't, all right? Maybe I don't really want to hear all that."},{"character":"ANGELA","text":"Oh, so now that you have a boyfriend, you're like, above it?We gotta get you a real man."},{"character":"RICKY","text":"You got any papers?"},{"character":"LESTER","text":"Yeah, in the cigar box, right over there.You know, put up a fight, dude! You are such a pushover. \"No I can't. Really. Okay.\""},{"character":"RICKY","text":"You should learn to roll a joint."},{"character":"LESTER","text":"Oh. Hi."},{"character":"JANE","text":"Where's Mom?"},{"character":"LESTER","text":"Don't know."},{"character":"ANGELA","text":"Hi, Mr. Burnham."},{"character":"LESTER","text":"Hi."},{"character":"ANGELA","text":"Wow. Look at you. Have you been working out?"},{"character":"LESTER","text":"Some."},{"character":"ANGELA","text":"You can really tell. Look at those arms."},{"character":"LESTER","text":"You like muscles?"},{"character":"ANGELA","text":"I--I should probably go see what Jane's up to."},{"character":"COLONEL","text":"Where'd you get that?"},{"character":"RICKY","text":"From my job."},{"character":"COLONEL","text":"Don't lie to me.I saw you with him."},{"character":"RICKY","text":"You were watching me?"},{"character":"COLONEL","text":"What did he make you do?"},{"character":"RICKY","text":"Dad, you don't really think... me and Mr. Burnham?"},{"character":"COLONEL","text":"Don't you laugh at me!I will not sit back and watch my only son become a cocksucker!"},{"character":"RICKY","text":"Jesus, what is with you--"},{"character":"COLONEL","text":"I swear to God, I will throw you out of this house and never look at you again."},{"character":"RICKY","text":"You mean that?"},{"character":"COLONEL","text":"Damn straight I do. I'd rather you were dead than be a fucking faggot."},{"character":"RICKY","text":"You're right. I suck dick for money."},{"character":"COLONEL","text":"Boy--"},{"character":"RICKY","text":"Two thousand dollars. I'm that good."},{"character":"COLONEL","text":"Get out."},{"character":"RICKY","text":"And you should see me fuck. I'm the best piece of ass in three states."},{"character":"COLONEL","text":"Get out!! I don't ever want to see you again!!"},{"character":"RICKY","text":"What a sad old man you are."},{"character":"COLONEL","text":"Get out."},{"character":"RICKY","text":"Mom, I'm leaving."},{"character":"BARBARA","text":"Okay, wear a raincoat."},{"character":"RICKY","text":"I wish things would have been better for you. Take care of Dad.--disinvesting problems of their power, and removing their ability to make us afraid. This is the secret to \"me-centered\" living. Only by taking full responsibility for your problems--and their solutions--will you ever be able to break free from the constant cycle of victimhood.TAPE VOICE (cont’d)Remember, you are only a victim if you choose to be a victim..."},{"character":"JANE","text":"I don't think we could be friends anymore."},{"character":"ANGELA","text":"You are way too uptight about sex."},{"character":"JANE","text":"Just don't fuck my dad, all right? Please?"},{"character":"ANGELA","text":"Why not?"},{"character":"JANE","text":"Dad! Leave us alone!"},{"character":"RICKY","text":"It's me.If I had to leave tonight, would you come with me?"},{"character":"JANE","text":"What?"},{"character":"RICKY","text":"If I had to go to New York. To live. Tonight. Would you come with me?"},{"character":"JANE","text":"Yes."},{"character":"ANGELA","text":"You guys can't be serious.You're just a kid. And he's like, a mental case. You'll end up living in a box on the street."},{"character":"JANE","text":"I'm no more a kid than you are!We can use my plastic surgery money."},{"character":"RICKY","text":"We won't have to. I have over forty thousand dollars. And I know people in the city who can help us get set up."},{"character":"ANGELA","text":"What, other drug dealers?"},{"character":"RICKY","text":"Yes."},{"character":"ANGELA","text":"Jane, you'd be out of your mind to go with him."},{"character":"JANE","text":"Why do you even care?"},{"character":"ANGELA","text":"Because you're my friend!"},{"character":"RICKY","text":"She's not your friend. She's somebody you use to feel better about yourself."},{"character":"ANGELA","text":"Go fuck yourself, psycho!"},{"character":"JANE","text":"You shut up, bitch!"},{"character":"ANGELA","text":"Jane! He is a freak!"},{"character":"JANE","text":"Well, then so am I! And we'll always be freaks and we'll never be like other people. And you'll never be a freak because you're just too perfect."},{"character":"ANGELA","text":"Oh, yeah? Well, at least I'm not ugly."},{"character":"RICKY","text":"Yes, you are. And you're boring. And you're totally ordinary. And you know it."},{"character":"ANGELA","text":"You two deserve each other."},{"character":"LESTER","text":"Jesus, man. You're soaked.You want me to get Ricky? He's in Jane's room.You okay?"},{"character":"COLONEL","text":"Where's your wife?"},{"character":"LESTER","text":"Uh... I don't know. Probably out fucking that dorky prince of real estate asshole. And you know what? I don't care."},{"character":"COLONEL","text":"Your wife is with another man and you don't care?"},{"character":"LESTER","text":"Nope, our marriage is just for show. A commercial, for how normal we are. When we are anything but.You're shaking.We really should get you out of these clothes."},{"character":"COLONEL","text":"Yes..."},{"character":"LESTER","text":"It's okay."},{"character":"COLONEL"},{"character":"LESTER","text":"Just tell me what you need.Whoa, whoa, whoa. I'm sorry. You got the wrong idea.\"I refuse to be a victim.\" When this becomes your mantra, constantly running through your head--"},{"character":"CAROLYN","text":"I refuse to be a victim."},{"character":"ANGELA","text":"I hope you don't mind if I play the stereo."},{"character":"LESTER","text":"Not at all.Bad night?"},{"character":"ANGELA","text":"Not really bad, just... strange."},{"character":"LESTER","text":"Believe me. It couldn't possibly be any stranger than mine."},{"character":"ANGELA","text":"Jane and I had a fight.It was about you.She's mad at me because I said I think you're sexy.is sexy."},{"character":"LESTER","text":"Do you want a sip?So... are you going to tell me? What you want?"},{"character":"ANGELA","text":"I don't know."},{"character":"LESTER","text":"You don't know?"},{"character":"ANGELA","text":"What do you want?"},{"character":"LESTER","text":"Are you kidding? I want you. I've wanted you since the first moment I saw you. You are the most beautiful thing I have ever seen."},{"character":"ANGELA","text":"You don't think I'm ordinary?"},{"character":"LESTER","text":"You couldn't be ordinary if you tried."},{"character":"ANGELA","text":"Thank you.I don't think there's anything worse than being ordinary..."},{"character":"CAROLYN","text":"I refuse to be a victim.I refuse to be a victim. I refuse to be a victim...Lester, I have something I have to say to you..."},{"character":"JANE","text":"Are you scared?"},{"character":"RICKY","text":"I don't get scared."},{"character":"JANE","text":"My parents will try to find me."},{"character":"RICKY","text":"Mine won't."},{"character":"ANGELA","text":"This is my first time."},{"character":"LESTER","text":"You're kidding."},{"character":"ANGELA","text":"I'm sorry.I still want to do it... I just thought I should tell you... in case you wondered why I wasn't... better.What's wrong? I thought you said I was beautiful."},{"character":"LESTER","text":"You are beautiful.You are so beautiful... and I would be a very lucky man..."},{"character":"ANGELA","text":"I feel so stupid."},{"character":"LESTER","text":"Don't."},{"character":"ANGELA","text":"I'm sorry."},{"character":"LESTER","text":"You have nothing to be sorry about.It's okay. Everything's okay."},{"character":"ANGELA","text":"Wow. I was starving."},{"character":"LESTER","text":"Do you want me to make you another one?"},{"character":"ANGELA","text":"No, no, no. I'm fine."},{"character":"LESTER","text":"You sure?"},{"character":"ANGELA","text":"I mean, I'm still a little weirded out, but......I feel better. Thanks."},{"character":"LESTER","text":"How's Jane?"},{"character":"ANGELA","text":"What do you mean?"},{"character":"LESTER","text":"I mean, how's her life? Is she happy? Is she miserable? I'd really like to know, and she'd die before she'd ever tell me about it."},{"character":"ANGELA","text":"She's... she's really happy. She thinks she's in love."},{"character":"LESTER","text":"Good for her."},{"character":"ANGELA","text":"How are you?"},{"character":"LESTER","text":"God, it's been a long time since anybody asked me that.I'm great."},{"character":"ANGELA","text":"I've gotta go to the bathroom."},{"character":"LESTER","text":"I'm great.Man oh man...Man oh man oh man..."},{"character":"JANE","text":"Oh God."},{"character":"RICKY","text":"Wow."}]
